#Generated by Fabric Compiler ( version 2022.1 <build 99559> ) at Fri Oct 24 15:43:32 2025

remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/wb.sv"
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
add_design "D:/work/SME309-CPU/rtl/KeyDebounce.v"
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
pnr 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
remove_design -force -verilog "D:/work/SME309-CPU/rtl/benchmark.sv"
add_design "D:/work/SME309-CPU/pds/top.v"
remove_design -force -verilog "D:/work/SME309-CPU/pds/top.sv"
add_design "D:/work/SME309-CPU/rtl/benchmark.v"
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
add_design D:/work/SME309-CPU/pds/ipcore/pll_old/pll_old.idf
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/ex.sv"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/ex.v"
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
pnr 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -top_module {top} -verilog_standard {SystemVerilog} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream -feature_value {389C2} 
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -top_module {top} -verilog_standard {SystemVerilog} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream -feature_value {389C2} 
remove_design -verilog "D:/work/SME309-CPU/rtl/dram_driver.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/PCgen.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/imm_gen.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/if.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/id.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/ex.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/CPU_TOP.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/ls.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/rf.sv"
add_design "D:/work/SME309-CPU/rtl/dram_driver.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/CPU_TOP.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/ex.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/id.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/if.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/imm_gen.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/ls.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/PCgen.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/rf.v"
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -top_module {top} -verilog_standard {SystemVerilog} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream -feature_value {389C2} 
remove_design -verilog "D:/work/SME309-CPU/rtl/dram_driver.sv"
add_design "D:/work/SME309-CPU/rtl/dram_driver.v"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/CPU_TOP.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/id.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/if.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/imm_gen.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/ls.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/PCgen.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/rf.sv"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/CPU_TOP.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/id.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/if.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/imm_gen.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/ls.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/PCgen.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/rf.v"
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
remove_design -verilog "D:/work/SME309-CPU/rtl/dram_driver.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/CPU_TOP.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/ex.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/id.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/if.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/imm_gen.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/ls.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/PCgen.sv"
remove_design -verilog "D:/work/SME309-CPU/rtl/cpu_ref1/rf.sv"
add_design "D:/work/SME309-CPU/rtl/dram_driver.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/CPU_TOP.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/ex.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/id.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/if.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/imm_gen.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/ls.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/PCgen.v"
add_design "D:/work/SME309-CPU/rtl/cpu_ref2/rf.v"
set_arch -family Compact -device PGC7KD -speedgrade -6 -package MBG256
compile -system_verilog -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream -feature_value {389C2} 
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/ex.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/CPU_TOP.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/id.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/if.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/imm_gen.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/ls.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/PCgen.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/rf.v"
add_design "D:/work/SME309-RISCV/rtl/cpu/CPU_TOP.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/CPU_TOP.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/ex.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/id.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/if.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/imm_gen.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/ls.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/PCgen.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/rf.v"
add_design "D:/work/SME309-RISCV/rtl/cpu/CPU_TOP.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/CPU_TOP.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/ex.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/id.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/if.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/imm_gen.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/ls.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/PCgen.v"
remove_design -verilog "D:/work/SME309-RISCV/rtl/cpu_ref2/rf.v"
add_design "D:/work/SME309-RISCV/rtl/cpu/CPU_TOP.v"
